### Importing the Packages

In [1]:
import pandas as pd
import numpy as np

### Importing the data

In [2]:
raw_csv_data = pd.read_csv("Index2018.csv") 
df_comp=raw_csv_data.copy()

### Lenght of the Time Period

In [3]:
df_comp.describe()

               spx           dax         ftse        nikkei
count  6269.000000   6269.000000  6269.000000   6269.000000
mean   1288.127542   6080.063363  5422.713545  14597.055700
std     487.586473   2754.361032  1145.572428   4043.122953
min     438.920000   1911.700000  2876.600000   7054.980000
25%     990.671905   4069.350000  4486.100000  10709.290000
50%    1233.420000   5773.340000  5662.430000  15028.170000
75%    1459.987747   7443.070000  6304.250000  17860.470000
max    2872.867839  13559.600000  7778.637689  24124.150000

In [4]:
df_comp.head()

         date     spx      dax     ftse    nikkei
0  07/01/1994  469.90  2224.95  3445.98  18124.01
1  10/01/1994  475.27  2225.00  3440.58  18443.44
2  11/01/1994  474.13  2228.10  3413.77  18485.25
3  12/01/1994  474.17  2182.06  3372.02  18793.88
4  13/01/1994  472.47  2142.37  3360.01  18577.26

In [6]:
df_comp.date.describe()

count           6269
unique          6269
top       15/07/1994
freq               1
Name: date, dtype: object

### From Text to Date

Para convertir una columna de fechas "**_date_**", de un *dataframe*, a tipo *datetime* se usa la función **pandas.to_datetime()**, aunque se tiene que considerar que la función interpreta por deafult que la columna de fechas está en el siguiente formato:

$$
mm/dd/yyyy
$$

Sin embargo, nuestra columna **_date_** está en el siguiente formato:

$$
dd/mm/yyyy
$$

para indicar esto en la transformación tenemos que escribir el siguiente argumento en la función **_pandas.to_datetime()_**:

**_dayfirst = True_**

- **_dayfirst_**: bool, default False
    Specify a date parse order if arg is str or its list-likes. If True, parses dates with the day first, eg 10/11/12 is parsed as 2012-11-10. Warning: dayfirst=True is not strict, but will prefer to parse with day first (this is a known bug, based on dateutil behavior).
    
Si el formato fuese:

$$
yyyy/mm/dd
$$

se tiene similarmente que escribir otro argumento

**_yearfirst = True_**

- **_yearfirst_**: bool, default False
    Specify a date parse order if arg is str or its list-likes.

    If True parses dates with the year first, eg 10/11/12 is parsed as 2010-11-12.

    If both dayfirst and yearfirst are True, yearfirst is preceded (same as dateutil).

    Warning: yearfirst=True is not strict, but will prefer to parse with year first (this is a known bug, based on dateutil behavior).

In [7]:
df_comp.date = pd.to_datetime(df_comp.date, dayfirst = True)

In [8]:
df_comp.head()

        date     spx      dax     ftse    nikkei
0 1994-01-07  469.90  2224.95  3445.98  18124.01
1 1994-01-10  475.27  2225.00  3440.58  18443.44
2 1994-01-11  474.13  2228.10  3413.77  18485.25
3 1994-01-12  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26

In [9]:
df_comp.date.describe()

count                    6269
unique                   6269
top       1999-08-23 00:00:00
freq                        1
first     1994-01-07 00:00:00
last      2018-01-29 00:00:00
Name: date, dtype: object

### Setting the Index

Para convertir la columna **_date_** en el índice de los datos tenemos el método

**set_index("Date column")**

mostraremos la diferencia entre usar 

**inplace = True**   $\&$   **inplace = False** (default)

In [12]:
df_comp.set_index("date")

                    spx       dax         ftse    nikkei
date
07/01/1994   469.900000   2224.95  3445.980000  18124.01
10/01/1994   475.270000   2225.00  3440.580000  18443.44
11/01/1994   474.130000   2228.10  3413.770000  18485.25
12/01/1994   474.170000   2182.06  3372.020000  18793.88
13/01/1994   472.470000   2142.37  3360.010000  18577.26
...                 ...       ...          ...       ...
23/01/2018  2839.130362  13559.60  7731.827774  24124.15
24/01/2018  2837.544008  13414.74  7643.428966  23940.78
25/01/2018  2839.253031  13298.36  7615.839954  23669.49
26/01/2018  2872.867839  13340.17  7665.541292  23631.88
29/01/2018  2853.528411  13324.48  7671.533300  23629.34

[6269 rows x 4 columns]

In [10]:
df_comp.set_index("date", inplace=True)

In [11]:
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

In [12]:
df_comp.date.describe()
#Expect to get an error message because we no longer have a "date" column since it is the index

AttributeError: 'DataFrame' object has no attribute 'date'

### Setting the Desired Frequency

Con el método **asfreq()** podemos establecer la frecuencia de nuestros datos, donde hay palabras reservadas para indicar las sigueintes frecuencias:

- 'h' = hourly
- 'd' = daily
- ´w´ = weekly
- 'm' = monthly
- 'a' = annualy

In [13]:
df_comp=df_comp.asfreq('d')

In [14]:
df_comp

                    spx       dax         ftse    nikkei
date
1994-01-07   469.900000   2224.95  3445.980000  18124.01
1994-01-08          NaN       NaN          NaN       NaN
1994-01-09          NaN       NaN          NaN       NaN
1994-01-10   475.270000   2225.00  3440.580000  18443.44
1994-01-11   474.130000   2228.10  3413.770000  18485.25
...                 ...       ...          ...       ...
2018-01-25  2839.253031  13298.36  7615.839954  23669.49
2018-01-26  2872.867839  13340.17  7665.541292  23631.88
2018-01-27          NaN       NaN          NaN       NaN
2018-01-28          NaN       NaN          NaN       NaN
2018-01-29  2853.528411  13324.48  7671.533300  23629.34

[8789 rows x 4 columns]

Los datos faltantes corresponden a los fines de semana, datos que no nos interesan puseto que el *dataframe* sólo contiene datos de los días de trabajo ("*business day*") lo cual lo indicamos con la palabra

'b' = business day.

In [15]:
df_comp=df_comp.asfreq('b')

In [16]:
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

### Handling Missing Values

Para llenar los valores perdidos de nuestro nuevo *dataframe*, ya sea porque al principio faltaban los datos o después de establecer una frecuencia, hay tres maneras principales de hacerlo con el método **_fillna()_**:

- **_method = ffill (front filling):_** Assigns the value of the previos period.
- **_method = bfill (back filling):_** Assigns the value for the next period.
- **_value = dataframe.column.mean() (Assigning the same value)_** Assign the avergae to all the missing values within the time-series.

In [17]:
df_comp.isna()

              spx    dax   ftse  nikkei
date
1994-01-07  False  False  False   False
1994-01-10  False  False  False   False
1994-01-11  False  False  False   False
1994-01-12  False  False  False   False
1994-01-13  False  False  False   False
...           ...    ...    ...     ...
2018-01-23  False  False  False   False
2018-01-24  False  False  False   False
2018-01-25  False  False  False   False
2018-01-26  False  False  False   False
2018-01-29  False  False  False   False

[6277 rows x 4 columns]

In [18]:
df_comp.isna().sum()

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

In [19]:
df_comp

                    spx       dax         ftse    nikkei
date
1994-01-07   469.900000   2224.95  3445.980000  18124.01
1994-01-10   475.270000   2225.00  3440.580000  18443.44
1994-01-11   474.130000   2228.10  3413.770000  18485.25
1994-01-12   474.170000   2182.06  3372.020000  18793.88
1994-01-13   472.470000   2142.37  3360.010000  18577.26
...                 ...       ...          ...       ...
2018-01-23  2839.130362  13559.60  7731.827774  24124.15
2018-01-24  2837.544008  13414.74  7643.428966  23940.78
2018-01-25  2839.253031  13298.36  7615.839954  23669.49
2018-01-26  2872.867839  13340.17  7665.541292  23631.88
2018-01-29  2853.528411  13324.48  7671.533300  23629.34

[6277 rows x 4 columns]

In [20]:
df_comp.spx=df_comp.spx.fillna(method='ffill')

Comprobemos que ya no hay valores perdidos en la columna **spx**:

In [21]:
df_comp.isna().sum()

spx       0
dax       8
ftse      8
nikkei    8
dtype: int64

In [22]:
df_comp.ftse=df_comp.ftse.fillna(method='bfill')

In [23]:
df_comp.isna().sum()

spx       0
dax       8
ftse      0
nikkei    8
dtype: int64

In [24]:
df_comp.dax=df_comp.dax.fillna(value = df_comp.dax.mean())

In [25]:
df_comp.isna().sum()

spx       0
dax       0
ftse      0
nikkei    8
dtype: int64

In [26]:
df_comp.nikkei=df_comp.nikkei.fillna(value = df_comp.nikkei.mean())

In [27]:
df_comp.isna().sum()

spx       0
dax       0
ftse      0
nikkei    0
dtype: int64

### Simplifying the Dataset

Nos interesa analizar como se comporta la columna **spx** (*S&P 500*), por ello, tenemos que remover el resto de columnas debido a que entre menos datos carguemos, más rápido podemos manipularlos.

In [28]:
df_comp['market_value']=df_comp.spx

In [29]:
df_comp.describe()

               spx           dax         ftse        nikkei  market_value
count  6277.000000   6277.000000  6277.000000   6277.000000   6277.000000
mean   1288.642547   6080.063363  5423.690398  14597.055700   1288.642547
std     487.868210   2752.604984  1145.568370   4040.545253    487.868210
min     438.920000   1911.700000  2876.600000   7054.980000    438.920000
25%     992.715221   4070.460000  4487.880000  10711.090000    992.715221
50%    1233.761241   5774.380000  5663.300000  15014.040000   1233.761241
75%    1460.250000   7442.660000  6304.630175  17858.420000   1460.250000
max    2872.867839  13559.600000  7778.637689  24124.150000   2872.867839

In [30]:
del df_comp['spx']

In [31]:
df_comp.describe()

                dax         ftse        nikkei  market_value
count   6277.000000  6277.000000   6277.000000   6277.000000
mean    6080.063363  5423.690398  14597.055700   1288.642547
std     2752.604984  1145.568370   4040.545253    487.868210
min     1911.700000  2876.600000   7054.980000    438.920000
25%     4070.460000  4487.880000  10711.090000    992.715221
50%     5774.380000  5663.300000  15014.040000   1233.761241
75%     7442.660000  6304.630175  17858.420000   1460.250000
max    13559.600000  7778.637689  24124.150000   2872.867839

In [32]:
del df_comp['dax']
del df_comp['ftse']
del df_comp['nikkei']

In [33]:
df_comp.describe()

       market_value
count   6277.000000
mean    1288.642547
std      487.868210
min      438.920000
25%      992.715221
50%     1233.761241
75%     1460.250000
max     2872.867839

### Splitting the Data

Nos interesa dividir nuestros datos en un cnojunto de entrenamiento ($80\%$) y uno de prueba para testear el modelo ($20\%$). Por lo general, primero se revuelven los datos y luego se definen los conjunto. Sin embargo, en el caso de *Time-Series* necesitamos preservar el orden cronólogico ya que aquí si importa. El método adecuado apra crear estos conjuntos es **_iloc[]_** puesto que corta a un *dataframe* de acuerdo a los parámetros dentro de este método.

In [34]:
size = int(len(df_comp)*0.8)

**_Conjunto de entrenamiento_**

In [35]:
df = df_comp.iloc[:size]

**_Conjunto de prueba_**

In [36]:
df_test = df_comp.iloc[size:]

Verifiquemos qye no hay valores traslapados:

In [37]:
df.tail()

            market_value
date
2013-04-01   1562.173837
2013-04-02   1570.252238
2013-04-03   1553.686978
2013-04-04   1559.979316
2013-04-05   1553.278930

In [38]:
df_test.head()

            market_value
date
2013-04-08   1563.071269
2013-04-09   1568.607909
2013-04-10   1587.731827
2013-04-11   1593.369863
2013-04-12   1588.854623

Se observa que no hay valores traslapados y que hay un salto del 5 al 8 de Abril puesto que no consideramos los fines de semana como se había indicado anteriormente.